<script setup lang="ts"></script>
<template>
  <el-row>
    <el-col class="my-col info-title" :span="2">
      <el-tag size="large">导入</el-tag>
    </el-col>
    <el-col class="my-col" :span="22">
      监考为不可分割的最小单元。即，如需将一次2人监考分别下发至2个专业，需分解为2次1人监考。在表格复制一行，或通过系统监考`剪裁`功能实现。
      <br />
      导入监考请使用监考表格模板。提供2种时间模式，匹配学校下发的不同时间类型。
      <br />
      必须选择`阶段/期末`类型，才能提交。没有设置默认值，是为了避免忘记选择而误提交。
      <br />
      可手动单项录入监考。
    </el-col>
    <el-col class="my-col info-title" :span="2">
      <el-tag size="large">下发</el-tag>
    </el-col>
    <el-col class="my-col" :span="22">
      批量下发，多项选择监考并指定部门后，保存提交。
      <br />
      通知专业，向专业发送监考分配提醒通知。
    </el-col>
    <el-col class="my-col info-title" :span="2">
      <el-tag size="large">处理</el-tag>
    </el-col>
    <el-col class="my-col" :span="22">
      默认加载8日内所有监考信息，可自定义任意日期段；可通过选项卡掌握监考信息的通知/分配/下发状态；可发送提醒专业分配通知；可发送监考说明，例如大厅取卷；可导出excel表格，带字体样式，按授课教师排序/课程名称，合并剪裁的监考。
      <br />
      添加紧凑的信息。
    </el-col>
    <el-col class="my-col info-title" :span="2">
      <el-tag size="large">编辑</el-tag>
    </el-col>
    <el-col class="my-col" :span="22">
      编辑，导入状态/下发未分配状态：学院可修改监考时间等关键信息；已分配状态：由于已下发监考通知，因此监考时间等关键信息为锁定状态禁止修改，必须重置监考为导入状态后修改。
      <br />
      重置监考，重置监考为未下发状态，可重新下发至其他专业。如果已分配则移除监考分配信息，同时发送监考取消通知/取消日程。
      <br />
      移除监考，如果已分配则移除监考分配信息，同时发送监考取消通知/取消日程。
    </el-col>
    <el-col class="my-col info-title" :span="2">
      <el-tag size="large">分配</el-tag>
    </el-col>
    <el-col class="my-col" :span="22">
      剪裁，可将监考`剪裁`出一个监考人数为1的新监考，原监考人数-1。
      <br />
      分配，学院可不受监考人数限制/部门等限制，直接任意分配监考。
    </el-col>
    <el-col class="my-col info-title" :span="2">
      <el-tag size="large">功能</el-tag>
    </el-col>
    <el-col class="my-col" :span="22">
      关闭分配，学院可以关闭指定部门，不在下发视图中显示。
      <br />
      导出详细信息，导出包含监考数据/导入/下发/分配/通知/每教师监考次数等信息的Excel表格。
      <br />
      导入课表，导入全学院课表，将删除原学院下全部教师课表，以新课表为准；导入教师课表，将删除指定教师原课表，以新课表为准。
      注意：如果导入学院课表后，单独导入教师课表，再次导入学院课表，则教师课表也将全部删除并以学院课表为准。即系统以最新录入课表为准重置。
      <br />
      重置密码，重置指定用户密码为账号。
      <br />
      更新用户部门，更新指定用户所在部门。
      <br />
      重置密码，重置指定用户密码为工号。
      <br />
      更新用户角色，更新用户权限角色。
      <br />
      移除用户，将指定用户从系统移除，在期末统计数据时，将不再统计该用户。
      <br />
      添加用户，基于钉钉手机号添加用户。
      <br />
      移除部门，禁止移除仍包含用户的部门，预移除部门，需将部门下用户移到其他部门。
      <br />
      更新部门，更新部门名称。
      <br />
      学期初始化，移除上学期全部监考/分配/课表信息，用于学期初始化数据重新统计。
    </el-col>
  </el-row>
</template>
